### 1 - Importing Libraries

In [2]:
import pandas as pd
import numpy as np

### 2 - Uploading the Dataset

In [3]:
dts = pd.read_csv("Salary.csv")
dts

       age  education.num  capital.gain  hours.per.week income
0       90              9             0              40  <=50K
1       82              9             0              18  <=50K
2       66             10             0              40  <=50K
3       54              4             0              40  <=50K
4       41             10             0              40  <=50K
...    ...            ...           ...             ...    ...
32556   22             10             0              40  <=50K
32557   27             12             0              38  <=50K
32558   40              9             0              40   >50K
32559   58              9             0              40  <=50K
32560   22              9             0              20  <=50K

[32561 rows x 5 columns]

### 3 - Summarizing the Dataset

In [4]:
dts.shape

(32561, 5)

In [5]:
dts.columns

Index(['age', 'education.num', 'capital.gain', 'hours.per.week', 'income'], dtype='object')

In [7]:
dts.head(5)

   age  education.num  capital.gain  hours.per.week income
0   90              9             0              40  <=50K
1   82              9             0              18  <=50K
2   66             10             0              40  <=50K
3   54              4             0              40  <=50K
4   41             10             0              40  <=50K

### 4 - Mapping Salary Data to Binary Value